package javaexp.a09_inherit;

public class A11_AbstractClass {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		/*
		# 추상 클래스(Abstract Class)
		1. 추상 : 실체들 간에 공통되는 특성을 추출한 것을 말한다.
			삼성, 현대, LG ==> 회사
			새, 곤충, 물고기 ==> 동물
		2. 추상클래스
			실체 클래스들의 공통되는 필드와 메소드 정의한 클래스
			추상적인 메서드를 선언하고, 하위클래스에서 이 메서드를 반드시(***)
			재정의하게 한 것을 말한다. ==> 추상메서드가 하나라도 있으면 
			추상클래스가 된다.
		3. 특징
			1) 일반 클래스와 거의 유사하고, 추상메서드만 있다.
			2) 추상메서드는 하위에서 반드시 재정의해야 하는 부분(다형성 처리 필요)
			3) 추상클래스는 단독으로 객체생성을 하지 못 한다.
				추상클래스 = new 상속받은실제객체(); 로만 객체 생성.
				
	
		 * */
	}

}
