package javaexp.z01_home;

public class A09_0413 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
/*
2023-04-13
[1단계:개념] 1. 링크시 상대위치 지정과 절대위치 지정 차이점을 기술하고, 
[1단계:개념] 2. 링크시 현재 파일을 기준으로 상위폴드와 하위폴드 이동 처리를 예제를 통해서 설명하세요.
[1단계:개념] 3. iframe의 속성을 예제를 통해서 설명하세요.
[1단계:확인] 4. 좋아하는 맛집 홈페이지를 맛집의 종류에 따라 링크되게 처리해보세요.
[1단계:개념] 5. target 속성값의 종류를 기술하세요.
[1단계:개념] 6. input select textarea의 차이점을 기술하세요.
[1단계:확인] 7. 기본 input 객체를 활용하여 아래와 같이 출력(form과 name 속성포함)하세요.
                   사람등록
		이름	[   ]
		나이	[   ]
		사는곳	[   ]
		    [등록]
[1단계:확인] 8. type으로 check와 radio의 차이점을 예제를 기술하세요
[1단계:확인] 9. 출근시간대(6:00,7:00,8:00,9:00와 퇴근시간대(17:00,18:00,19:00,20:00)를 단일 선택할 수 있게 처리하세요
[1단계:개념] 10. form하위에 form요소객체가 서버에 데이터를 전송하는 규칙을 기술하세요.
[1단계:개념] 11. select form태그에서 option에서 value의 설정이유에 대하여 기술하세요.
[1단계:확인] 12. 주로 사용하는 지역과 우편번호를 검색해서 select로 지역을 선택했을 때, 서버에 우편번호가 전송되게 처리하세요.

*/
	}

}
