package javaexp.z01_home;

public class A11_0418 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
/*
2023-04-18
[1단계:개념] 1. 오늘 진행한 css 속성을 다른 예제와 함께 기술해보세요.
[1단계:개념] 2. css 선언 선택자와 함께 선언한 형식을 구성요소별 내용을 예제와 함께 기술하세요
[1단계:개념] 3. css 선언 형식(기본,외부,inline)을 예제를 만들고 설명하세요.
[1단계:개념] 3. 선택자의 종류를 간단한 예제와 함께 기술하세요.
[1단계:확인] 4. webapp하위에 a00_com폴드에 z03_style.css로 h1,h2의 배경색상,글자색을 지정하여, 현재폴드에서 적용되게 절대 경로로 처리하여 출력하세요.
[1단계:개념] 5. 1:다 관계의 필드기준 예제(필드만 선언, 메서드 처리x)를 만들어 보자
[1단계:개념] 6. 상속의 기본형식을 알고 접근제어자의 한계와 함께 예제를 만들어 보자.


*/
	}

}
