package javaexp.z01_home;

public class A12_0419 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
/*
2023-04-18
[1단계:조별] 1. 접근제어자에 이해와 구현
		1) 접근제어자의 4가지 이해하고 설명할 수 있는가?
		2) 접근제어자에 맞게 구현할 수 있는가?
		3) default와 protected의 상속관계 객체내에서 호출시 어떤 문제가 있고, 원인은 무엇인가?
		4) 아래 구조에 의해 접근제어자에 따른 호출 내용을 처리해 보자.
			패키지1 : 참외, 사과, 멜론(참외상속), 바나나, 딸기
			패키지2 : 당근, 양파
			패키지3 : 수박(참외상속)
		   패키지1의 참외에 접근제어자 4가지와 호출하는 메서드를 정의하고 각 클래스에서 호출해보세요.
[1단계:개념] 2. this.필드, this()의 사용에 있어서 차이점을 예제로 기술하세요.
[1단계:확인] 3. Team(팀명,승,무,패,승률)을 생성자의 매개변수(0~5)로 오버 로딩 선언하여 this()로 호출 처리하게 하세요
[1단계:개념] 4. this, super의 차이를 상속관계에서 필드, 생성자, 메서드의 관점에서 예제를 통해 기술하세요.
[1단계:개념] 5. 메서드 오버라이딩(overriding)을 메서드 오버로딩(overloading)과의 차이점을 기술해보세요.
[1단계:개념] 6. 선택자중 태그, 아이디, 클래스, 중첩적용의 예를 만들고 설명하세요.

 * */
	}

}
