package javaexp.z01_home;

public class A15_0425 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		/*
2023-04-25
[1단계:개념] 1. 예외 처리의 기본형식 코드는 수행시키고, 해당 코드가 의미하는 바를 구체적으로 기술하세요.
[1단계:확인] 2. args로 입력 받게 하고, 물건명 가격 갯수를 입력 받게 하고 입력이 없을 시  "물건정보를 입력하세요!" 라고 예외 처리로 처리되게 하세요.
[1단계:개념] 3. 실행예외와 컴파일예외의 차이점을 예제로 설명하세요.
[1단계:개념] 4. 예외처리의 계층 구조에 따른 선언 순서를 기술하세요.
[1단계:확인] 5. args[0], String name=null;name.toString(); 해당 내용을 구체적 예외는 처리하고, 그외는 Exception처리하는다중예외를 처리하세요.
[1단계:개념] 6. 동적처리하는 가상클래스의 내용을 예제와 함께 기술하세요.
[1단계:개념] 7. 공통 속성값인 색상 선언 규칙 3가지를 기술하세요
[1단계:개념] 8. 공통 속성값인 단위(크기,넓이,폭)을 기본예제와 함께 설명하세요
		 
		 */
	}

}
