package javaexp.z01_home;

public class A16_0426 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
/*
2023-04-25
[1단계:조원] 1. 예외처리에 대한 이론과 실습(조원들과 아래 내용에 대한 이야기를 수업 내용을 보면서 나누세요)
		1) 예외 처리를 왜 하는지 알고 있나요?
		2) 예외 처리를 하는 기본 단계별 구조를 설명할 수 있고, 코드할 수 있는지?
		3) args값이 입력하지 않을 때, 처리되는 메서드를 선언하고, 예외를 위임하세요.
		4) 아이디 입력시 8자미만 이거나 16자이상시 사용자 정의 예외를 발생하게 처리하세요
[1단계:개념] 2. css 문자열 관련 속성을 예제와 함께 기술하세요
[1단계:개념] 3. css box 모델의 단계별 속성을 설명하세요
[1단계:개념] 4. css border의 위치관련 속성, 굵기, 종류관련 개별적 속성과 전체 설정 처리를 기술하세요
[1단계:확인] 5. css box 모델의 모서리 둥글기 속성을 이용하여, 버튼1, 버튼2를 span으로 만들어 보세요.
[1단계:확인] 6. 예외 위임을 코드를 기본 예제와 함께 설명하세요.
[1단계:확인] 7. 1~10까지 출력할 때, 짝수인 경우에 사용자 정의 예외가 처리되게 하세요.


 */
	}

}
