package javaexp.z01_home;

public class A17_0427 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
/*
2023-04-27
[1단계:개념] 1. 배경이미지관련 속성을 예제와 함께 기술하세요.
[1단계:개념] 2. display의 속성 3개 특징을 예제와 함께 기술하세요
[1단계:개념] 3. 배경이미지관련 속성을 예제와 함께 기술하세요.
[1단계:확인] 4. css 글자 그림자 처리 옵션을 지정하여, 화면에 이름, 나이, 사는 곳을 출력하세요.
[1단계:개념] 5. position 옵션을 예제를 통해 기술하세요.
[1단계:개념] 6. Object의 메서드의 기능을 기술하세요.
[2단계:확인] 7. 물건명, 가격, 갯수를 필드로 하는 Product클래스를 생성하고 사용하되, 재정의하여 객체 생성 후, 참조 변수를 호출했을 때, 물건명/가격/갯수/총계를 출력할려면 처리해야 할 내용은?
[1단계:개념] 8. String의 비교연산자의 비교와 equals()처리 형식의 차이점에 대하여 기술하세요
[1단계:개념] 9. String 생성자의 주요 매개변수를 통한 처리 내용을 기술하세요
[1단계:확인] 10. 임시비밀번호를 알파벳 대소문자 숫자를 조합해서 10자를 만드는 프로그램을 만드세요
[2단계:확인] 11. charAt()를 활용하여, 우리나라에서 가장 많은 성 1~10, 가장 많이 사용하는 이름 중간자, 가장 많이 사용하는 마지막자를 조합하여 임의의 이름 3개를 출력하세요

 * */
	}

}
