package javaexp.z01_home;

public class A18_0428 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
/*
금주 주간 핵심 개념 정리(조별)
1. 추상클래스의 기본 코드를 작성할 수 있는가?
2. 추상클래스를 이용해서 상위 Airplane fly() 재정의, 하위 여러가지 로봇의 종류를 fly()을 통해 날으는 거리를 재정의로 처리할 수 있는가?
3. 인터페이스의 기본 코드를 작성할 수 있는가?
4. 인터페이스로 Weapon선언 attack()재정의하고, 하위 메서드 Rocket, Missile, Kick
5. 추상클래스와 인터페이스의 차이점을 알고 있는가?
6. 추상클래스와 인터페이스를 활용하여 1:다 관계 구조를 알고 활용할 수 있는가?
=== 금주 메인 내용 ===
7. 예외 처리의 기본 코드를 작성할 수 있는가?
8. 예외 처리의 단계별 어디까지 작성할 수 있는가?
9. 예외의 위임을 이해하고 구현할 수 있는가?
    두개의 데이터를 입력받아서, 나눗셈을 처리할 때, 0으로 나눌 때,
    예외가 나오는데 그 예외를 위임시키는 메서드를 선언하고
    호출하세요.
10. 사용자 정의을 이해하고 구현할 수 있는가?
    구구단 문제가 임의로 제출되고 맞추면 정답 그대로 처리, 
    못 맞추면 사용자 정의 예외 던져서 처리.

*/
	}

}
